ansa256/touchscreen-apps/src/lib/stm32f30xPeripherals.c
/**
 * @file stm32f30xPeripherals.c
 *
 * @date 05.12.2012
 * @author Armin Joachimsmeyer
 * armin.joachimsmeyer@gmx.de
 * @copyright LGPL v3 (http://www.gnu.org/licenses/lgpl.html)
 * @version 1.5.0
 */
 
#include "stm32f30xPeripherals.h"
#include "stm32f3_discovery_lsm303dlhc.h"
#include "stm32f3_discovery_l3gd20.h"
#include "timing.h"
#include "stm32f30x_tim.h"
#include "stm32f3_discovery.h"
#include <stdio.h>

/** @addtogroup Peripherals_Library
 * @{
 */

/**
 *  Calibrating with value from SystemMemory:
 *
 *    ActualRefVoltageADC = ((CalValueForRefint * 3.3V) / ActualReadingRefint)
 *
 *          3V                 Reading 3V                         3.0V * 4096 * ActualReadingRefint
 *  -------------------  = --------------------- => Reading 3V = -------------------------------------
 *  ActualRefVoltageADC     Reading VRef (4096)                   CalValueForRefint * 3.3V
 *
 *  Formula for ScaleFactor (3V for 240 Pixel) is:
 *    Reading 3V * ScaleFactor = 240 (DISPLAY_HEIGHT)
 *
 *                       240  * 3.3V * CalValueForRefint
 *  => ADCScaleFactor = ---------------------------------
 *                       4096 * 3.0V * ActualReadingRefint
 *
 *                    CalValueForRefint
 *   = 0,064453125 * -------------------
 *                    ActualReadingRefint
 *
 *   0,064453125 * 2**20(=1048576) = 67584.0
 *
 */

float ADCToVoltFactor; // Factor for ADC Reading -> Volt = sVrefVoltage / 4096
uint16_t sReading3Volt; // Raw value for 3V input
uint16_t sRefintActualValue; // actual value of VREFINT / see *((uint16_t*) 0x1FFFF7BA) = value of VREFINT at 3.3V
unsigned int sADCScaleFactorShift18; // Factor for ADC Reading -> Display for 0,5 Volt/div(=40pixel) scale - shift 18 because we have 12 bit ADC and 12 + 18 + sign + buffer = 32 bit register
float sVrefVoltage;
uint16_t sTempValueAtZeroDegreeShift3 = 0;

/**
 * ADC must be ready and continuous mode disabled
 * read ref channel and use Value from Address 0x1FFFF7BA
 * USE ADC 2
 */
void ADC_setRawToVoltFactor(void) {

// use conservative sample time
    ADC_RegularChannelConfig(ADC2, ADC_Channel_Vrefint, 1, ADC_SampleTime_61Cycles5);

    ADC_StartConversion(ADC2);
// get VREFINT_CAL (value of reading calibration input acquired at temperature of 30 °C and VDDA=3.3 V) - see chapter 3.12.2 of datasheet
    uint16_t tREFCalibrationValue = *((uint16_t*) 0x1FFFF7BA);
    /* Test EOC flag */
    setTimeoutMillis(10);
    bool tTimeout = false;
    while (ADC_GetFlagStatus(ADC2, ADC_FLAG_EOC) == RESET) {
        if (isTimeout(ADC2->ISR)) {
            tTimeout = true;
            break;
        }
    }
    sRefintActualValue = ADC_GetConversionValue(ADC2);
    if (tTimeout) {
        sRefintActualValue = tREFCalibrationValue;
    }
    uint32_t tRefActualValue = sRefintActualValue; // 16 -> 32 bit
// use stored calibration value from system area
    sADCScaleFactorShift18 = tREFCalibrationValue * 16896 / tRefActualValue;
    sReading3Volt = (3.0 * tRefActualValue * 4096) / (3.3 * tREFCalibrationValue);
    sVrefVoltage = 3.3 * tREFCalibrationValue / tRefActualValue;
    ADCToVoltFactor = sVrefVoltage / 4096;
}

/**
 * Init the HY32D CS, Control/Data, WR, RD, and port D data pins
 */
void HY32D_IO_initalize(void) {
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Enable the GPIO Clocks */
    RCC_AHBPeriphClockCmd(HY32D_CS_GPIO_CLK, ENABLE);
    RCC_AHBPeriphClockCmd(HY32D_DATA_GPIO_CLK, ENABLE);

    // CS pin, Register/Data select pin, WR pin, RD pin
    GPIO_InitStructure.GPIO_Pin = HY32D_CS_PIN | HY32D_DATA_CONTROL_PIN | HY32D_WR_PIN | HY32D_RD_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(HY32D_CS_GPIO_PORT, &GPIO_InitStructure);
    // set HIGH
    GPIO_SetBits(HY32D_CS_GPIO_PORT, HY32D_CS_PIN | HY32D_WR_PIN | HY32D_RD_PIN);

    // 16 data pins
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_All;
    GPIO_Init(HY32D_DATA_GPIO_PORT, &GPIO_InitStructure);
}

/**
 * Pins for touch panel CS, PENINT
 */
#define ADS7846_CS_PIN                           GPIO_Pin_2
#define ADS7846_CS_GPIO_PORT                     GPIOB
#define ADS7846_CS_GPIO_CLK                      RCC_AHBPeriph_GPIOB

// Interrupt in pin
#define ADS7846_EXTI_PIN                         GPIO_Pin_1
#define ADS7846_EXTI_GPIO_PORT                   GPIOB
#define ADS7846_EXTI_GPIO_CLK                    RCC_AHBPeriph_GPIOB
#define ADS7846_EXTI_PORT_SOURCE                 EXTI_PortSourceGPIOB
#define ADS7846_EXTI_PIN_SOURCE                  EXTI_PinSource1
#define ADS7846_EXTI_LINE                        EXTI_Line1
#define ADS7846_EXTI_IRQn                        EXTI1_IRQn

void ADS7846_IO_initalize(void) {
    GPIO_InitTypeDef GPIO_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;
    EXTI_InitTypeDef EXTI_InitStructure;

    /* Enable the GPIO Clock */
    RCC_AHBPeriphClockCmd(ADS7846_CS_GPIO_CLK, ENABLE);

    // CS pin
    GPIO_InitStructure.GPIO_Pin = ADS7846_CS_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(ADS7846_CS_GPIO_PORT, &GPIO_InitStructure);
    // set HIGH
    GPIO_SetBits(ADS7846_CS_GPIO_PORT, ADS7846_CS_PIN);

    /* Enable the Clock */
    RCC_AHBPeriphClockCmd(ADS7846_EXTI_GPIO_CLK, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

    /* Configure pin as input */
    GPIO_InitStructure.GPIO_Pin = ADS7846_EXTI_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_Init(ADS7846_EXTI_GPIO_PORT, &GPIO_InitStructure);

    /* Connect EXTI Line to GPIO Pin */
    SYSCFG_EXTILineConfig(ADS7846_EXTI_PORT_SOURCE, ADS7846_EXTI_PIN_SOURCE);

    /* Configure EXTI line */
    EXTI_InitStructure.EXTI_Line = ADS7846_EXTI_LINE;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);

    /* 2 bit for pre-emption priority, 2 bits for subpriority */
    /* Enable and set EXTI Interrupt to the lowest priority */
    NVIC_InitStructure.NVIC_IRQChannel = ADS7846_EXTI_IRQn;
    // priority 2/3
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

/**
 * @return true if line is NOT active
 */
inline bool ADS7846_getInteruptLineLevel(void) {
    return GPIO_ReadInputDataBit(ADS7846_EXTI_GPIO_PORT, ADS7846_EXTI_PIN);
}

