ansa256/touchscreen-apps/src/lib/stm32f30xPeripherals.c
inline void ADS7846_ClearITPendingBit(void) {
    EXTI_ClearITPendingBit(ADS7846_EXTI_LINE);
}
/**
 * first clear pending interrupts
 */
void ADS7846_clearAndEnableInterrupt(void) {
//	// Enable  interrupt
//	uint32_t tmp = (uint32_t) EXTI_BASE + EXTI_Mode_Interrupt
//			+ (((STM32F3D_ADS7846_EXTI_LINE) >> 5) * 0x20);
//	/* Enable the selected external lines */
//	*(__IO uint32_t *) tmp |= (uint32_t) (1 << (STM32F3D_ADS7846_EXTI_LINE & 0x1F));

    EXTI_ClearITPendingBit(ADS7846_EXTI_LINE);
    NVIC_ClearPendingIRQ(ADS7846_EXTI_IRQn);
    NVIC_EnableIRQ(ADS7846_EXTI_IRQn);
}

void ADS7846_disableInterrupt(void) {
//	// Disable  interrupt
//	uint32_t tmp = (uint32_t) EXTI_BASE + EXTI_Mode_Interrupt
//			+ (((STM32F3D_ADS7846_EXTI_LINE) >> 5) * 0x20);
//	/* Disable the selected external lines */
//	*(__IO uint32_t *) tmp &= ~(uint32_t) (1 << (STM32F3D_ADS7846_EXTI_LINE & 0x1F));
//

    EXTI_ClearITPendingBit(ADS7846_EXTI_LINE);
    // Disable NVIC Int
    NVIC_DisableIRQ(ADS7846_EXTI_IRQn);
    NVIC_ClearPendingIRQ(ADS7846_EXTI_IRQn);
}

inline void ADS7846_CSEnable(void) {
    GPIO_ResetBits(ADS7846_CS_GPIO_PORT, ADS7846_CS_PIN);
}

inline void ADS7846_CSDisable(void) {
    GPIO_SetBits(ADS7846_CS_GPIO_PORT, ADS7846_CS_PIN);
}

/**
 *  2 pins for AccuCapacity relays
 */
#define ACCUCAP_DISCHARGE_1_PIN     GPIO_Pin_9
#define ACCUCAP_DISCHARGE_2_PIN     GPIO_Pin_10
#define ACCUCAP_CHARGE_1_PIN        GPIO_Pin_2
#define ACCUCAP_CHARGE_2_PIN        GPIO_Pin_4
#define ACCUCAP_GPIO_PORT           GPIOF
#define ACCUCAP_GPIO_CLK            RCC_AHBPeriph_GPIOF

void AccuCapacity_IO_initalize(void) {
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Enable the GPIO Clock */
    RCC_AHBPeriphClockCmd(ACCUCAP_GPIO_CLK, ENABLE);

    // Discharge 1+2 pin, Charge 1+2 pin
    GPIO_InitStructure.GPIO_Pin = ACCUCAP_DISCHARGE_1_PIN | ACCUCAP_DISCHARGE_2_PIN | ACCUCAP_CHARGE_1_PIN | ACCUCAP_CHARGE_2_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(ACCUCAP_GPIO_PORT, &GPIO_InitStructure);
    // set LOW
    GPIO_ResetBits(ACCUCAP_GPIO_PORT,
            ACCUCAP_DISCHARGE_1_PIN | ACCUCAP_DISCHARGE_2_PIN | ACCUCAP_CHARGE_1_PIN | ACCUCAP_CHARGE_2_PIN);
}

void AccuCapacity_SwitchDischarge(unsigned int aChannelIndex, bool aActive) {
    uint16_t tPinNr = ACCUCAP_DISCHARGE_2_PIN;
    if (aChannelIndex != 0) {
        tPinNr = ACCUCAP_DISCHARGE_1_PIN;
    }
    if (aActive) {
        ACCUCAP_GPIO_PORT->BSRR = tPinNr;
    } else {
        // Low
        ACCUCAP_GPIO_PORT->BRR = tPinNr;
    }
}

void AccuCapacity_SwitchCharge(unsigned int aChannelIndex, bool aActive) {
    uint16_t tPinNr = ACCUCAP_CHARGE_2_PIN;
    if (aChannelIndex != 0) {
        tPinNr = ACCUCAP_CHARGE_1_PIN;
    }
    if (aActive) {
        ACCUCAP_GPIO_PORT->BSRR = tPinNr;
    } else {
        // Low
        ACCUCAP_GPIO_PORT->BRR = tPinNr;
    }
}

/**
 * ADC2 for AccuCapacity
 */
#define ADC2_PERIPH_CLOCK                   	RCC_AHBPeriph_ADC12

// Two input pins
#define ADC2_INPUT1_CHANNEL                     ADC_Channel_6
#define ADC2_INPUT1_PIN                         GPIO_Pin_0
#define ADC2_INPUT1_GPIO_PORT                   GPIOC
#define ADC2_INPUT1_GPIO_CLK                    RCC_AHBPeriph_GPIOC

#define ADC2_INPUT2_CHANNEL                     ADC_Channel_7
#define ADC2_INPUT2_PIN                         GPIO_Pin_1
#define ADC2_INPUT2_GPIO_PORT                   GPIOC
#define ADC2_INPUT2_GPIO_CLK                    RCC_AHBPeriph_GPIOC

void ADC2_init(void) {
    GPIO_InitTypeDef GPIO_InitStructure;
    ADC_InitTypeDef ADC_InitStructure;
    ADC_CommonInitTypeDef ADC_CommonInitStructure;

    /* Enable ADC clock */
    RCC_AHBPeriphClockCmd(ADC2_PERIPH_CLOCK, ENABLE);

    /**
     * ADC GPIO input pin init
     */
    RCC_AHBPeriphClockCmd(ADC2_INPUT1_GPIO_CLK, ENABLE);
    /* Configure pin as analog input */
    GPIO_InitStructure.GPIO_Pin = ADC2_INPUT1_PIN | ADC2_INPUT2_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_Init(ADC2_INPUT1_GPIO_PORT, &GPIO_InitStructure);

    /**
     * Enable special channels
     */
    ADC_VrefintCmd(ADC2, ENABLE);

    /**
     *  Calibration procedure
     */
    ADC_VoltageRegulatorCmd(ADC2, ENABLE);
    /* To settle reference voltage etc. */
    delayMillis(2);
    ADC_SelectCalibrationMode(ADC2, ADC_CalibrationMode_Single);
    ADC_StartCalibration(ADC2);
    while (ADC_GetCalibrationStatus(ADC2) != RESET) {
        ;
    }

    // use defaults
    ADC_CommonStructInit(&ADC_CommonInitStructure);
    ADC_CommonInit(ADC2, &ADC_CommonInitStructure);

    // use defaults
    ADC_StructInit(&ADC_InitStructure);
    ADC_Init(ADC2, &ADC_InitStructure);

    /* Enable ADC */
    ADC_Cmd(ADC2, ENABLE);

    /* wait for ADRDY */
    setTimeoutMillis(20);
    while (!ADC_GetFlagStatus(ADC2, ADC_FLAG_RDY)) {
        if (isTimeout(ADC2->ISR)) {
            break;
        }
    }
    // set actual multiplier etc. by reading the ref voltage
    ADC_setRawToVoltFactor();
}

unsigned int AccuCapacity_ADCRead(uint8_t aProbeNumber) {
    if (aProbeNumber == 0) {
        ADC_RegularChannelConfig(ADC2, ADC2_INPUT1_CHANNEL, 1, ADC_SampleTime_61Cycles5);
    } else {
        ADC_RegularChannelConfig(ADC2, ADC2_INPUT2_CHANNEL, 1, ADC_SampleTime_61Cycles5);
    }
    ADC_StartConversion(ADC2);
    /* Test EOC flag */
    setTimeoutMillis(ADC_DEFAULT_TIMEOUT);
    while (ADC_GetFlagStatus(ADC2, ADC_FLAG_EOC) == RESET) {
        if (isTimeout(ADC2->ISR)) {
            break;
        }
    }
    return ADC_GetConversionValue(ADC2);
}

void Gyroscope_IO_initialize(void) {
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Configure GPIO PIN for Lis Chip select */
    GPIO_InitStructure.GPIO_Pin = L3GD20_SPI_CS_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(L3GD20_SPI_CS_GPIO_PORT, &GPIO_InitStructure);

