ansa256/touchscreen-apps/src/lib/stm32f30xPeripherals.c
    /* Deselect : Chip Select high */
    GPIO_SetBits(L3GD20_SPI_CS_GPIO_PORT, L3GD20_SPI_CS_PIN);

    /* Configure GPIO PINs to detect Interrupts */
    GPIO_InitStructure.GPIO_Pin = L3GD20_SPI_INT1_PIN | L3GD20_SPI_INT2_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_Init(L3GD20_SPI_INT1_GPIO_PORT, &GPIO_InitStructure);
}

/**
 * @brief  Configure the Mems L3GD20.
 */
void GyroscopeAndSPIInitialize(void) {
    L3GD20_InitTypeDef L3GD20_InitStructure;
    L3GD20_FilterConfigTypeDef L3GD20_FilterStructure;

    /* Configure Mems L3GD20 */
    L3GD20_InitStructure.Power_Mode = L3GD20_MODE_ACTIVE;
    L3GD20_InitStructure.Output_DataRate = L3GD20_OUTPUT_DATARATE_1;
    L3GD20_InitStructure.Axes_Enable = L3GD20_AXES_ENABLE;
    L3GD20_InitStructure.Band_Width = L3GD20_BANDWIDTH_4;
    L3GD20_InitStructure.BlockData_Update = L3GD20_BlockDataUpdate_Continous;
    L3GD20_InitStructure.Endianness = L3GD20_BLE_LSB;
    L3GD20_InitStructure.Full_Scale = L3GD20_FULLSCALE_500;
    L3GD20_Init(&L3GD20_InitStructure);

    L3GD20_FilterStructure.HighPassFilter_Mode_Selection = L3GD20_HPM_NORMAL_MODE_RES;
    L3GD20_FilterStructure.HighPassFilter_CutOff_Frequency = L3GD20_HPFCF_0;
    L3GD20_FilterConfig(&L3GD20_FilterStructure);

    L3GD20_FilterCmd(L3GD20_HIGHPASSFILTER_ENABLE);
}

/**
 * @brief  Configure the Mems to compass application.
 */
void initAcceleratorCompassChip(void) {
    SPI1_setPrescaler(SPI_BaudRatePrescaler_8);
    LSM303DLHCMag_InitTypeDef LSM303DLHC_InitStructure;
    LSM303DLHCAcc_InitTypeDef LSM303DLHCAcc_InitStructure;
    LSM303DLHCAcc_FilterConfigTypeDef LSM303DLHCFilter_InitStructure;

    /* Configure MEMS magnetometer main parameters: temp, working mode, full Scale and Data rate */
    LSM303DLHC_InitStructure.Temperature_Sensor = LSM303DLHC_TEMPSENSOR_ENABLE;
    LSM303DLHC_InitStructure.MagOutput_DataRate = LSM303DLHC_ODR_30_HZ;
    LSM303DLHC_InitStructure.MagFull_Scale = LSM303DLHC_FS_8_1_GA;
    LSM303DLHC_InitStructure.Working_Mode = LSM303DLHC_CONTINUOS_CONVERSION;
    LSM303DLHC_MagInit(&LSM303DLHC_InitStructure);

    /* Fill the accelerometer structure */
    LSM303DLHCAcc_InitStructure.Power_Mode = LSM303DLHC_NORMAL_MODE;
    LSM303DLHCAcc_InitStructure.AccOutput_DataRate = LSM303DLHC_ODR_50_HZ;
    LSM303DLHCAcc_InitStructure.Axes_Enable = LSM303DLHC_AXES_ENABLE;
    LSM303DLHCAcc_InitStructure.AccFull_Scale = LSM303DLHC_FULLSCALE_2G;
    LSM303DLHCAcc_InitStructure.BlockData_Update = LSM303DLHC_BlockUpdate_Continous;
    LSM303DLHCAcc_InitStructure.Endianness = LSM303DLHC_BLE_LSB;
    LSM303DLHCAcc_InitStructure.High_Resolution = LSM303DLHC_HR_ENABLE;
    /* Configure the accelerometer main parameters */
    LSM303DLHC_AccInit(&LSM303DLHCAcc_InitStructure);

    /* Fill the accelerometer LPF structure */
    LSM303DLHCFilter_InitStructure.HighPassFilter_Mode_Selection = LSM303DLHC_HPM_NORMAL_MODE;
    LSM303DLHCFilter_InitStructure.HighPassFilter_CutOff_Frequency = LSM303DLHC_HPFCF_16;
    LSM303DLHCFilter_InitStructure.HighPassFilter_AOI1 = LSM303DLHC_HPF_AOI1_DISABLE;
    LSM303DLHCFilter_InitStructure.HighPassFilter_AOI2 = LSM303DLHC_HPF_AOI2_DISABLE;

    /* Configure the accelerometer LPF main parameters */
    LSM303DLHC_AccFilterConfig(&LSM303DLHCFilter_InitStructure);
}
/**
 * init  STMF32F3 SPI_1 Interface pins CLK, MISO, MOSI
 */
#define STM32F3D_SPI1_CLK                   RCC_APB2Periph_SPI1

#define STM32F3D_SPI1_SCK_PIN               GPIO_Pin_5                  /* PA.05 */
#define STM32F3D_SPI1_GPIO_PORT             GPIOA                       /* GPIOA */
#define STM32F3D_SPI1_SCK_GPIO_CLK          RCC_AHBPeriph_GPIOA
#define STM32F3D_SPI1_SCK_SOURCE            GPIO_PinSource5
#define STM32F3D_SPI1_SCK_AF                GPIO_AF_5

#define STM32F3D_SPI1_MISO_PIN              GPIO_Pin_6                  /* PA.6 */
#define STM32F3D_SPI1_MISO_GPIO_PORT        GPIOA                       /* GPIOA */
#define STM32F3D_SPI1_MISO_GPIO_CLK         RCC_AHBPeriph_GPIOA
#define STM32F3D_SPI1_MISO_SOURCE           GPIO_PinSource6
#define STM32F3D_SPI1_MISO_AF               GPIO_AF_5

#define STM32F3D_SPI1_MOSI_PIN              GPIO_Pin_7                  /* PA.7 */
#define STM32F3D_SPI1_MOSI_GPIO_PORT        GPIOA                       /* GPIOA */
#define STM32F3D_SPI1_MOSI_GPIO_CLK         RCC_AHBPeriph_GPIOA
#define STM32F3D_SPI1_MOSI_SOURCE           GPIO_PinSource7
#define STM32F3D_SPI1_MOSI_AF               GPIO_AF_5

/**
 * init with prescaler 8
 */
static uint16_t actualPrescaler;
void SPI1_initialize(void) {
    GPIO_InitTypeDef GPIO_InitStructure;
    SPI_InitTypeDef SPI_InitStructure;

    /* Enable the SPI peripheral */
    RCC_APB2PeriphClockCmd(STM32F3D_SPI1_CLK, ENABLE);

    /* Enable SCK, MOSI and MISO GPIO clocks */
    RCC_AHBPeriphClockCmd(STM32F3D_SPI1_SCK_GPIO_CLK | STM32F3D_SPI1_MISO_GPIO_CLK | STM32F3D_SPI1_MOSI_GPIO_CLK, ENABLE);

    GPIO_PinAFConfig(STM32F3D_SPI1_GPIO_PORT, STM32F3D_SPI1_SCK_SOURCE, STM32F3D_SPI1_SCK_AF);
    GPIO_PinAFConfig(STM32F3D_SPI1_MISO_GPIO_PORT, STM32F3D_SPI1_MISO_SOURCE, STM32F3D_SPI1_MISO_AF);
    GPIO_PinAFConfig(STM32F3D_SPI1_MOSI_GPIO_PORT, STM32F3D_SPI1_MOSI_SOURCE, STM32F3D_SPI1_MOSI_AF);

    /* SPI SCK, MOSI, MISO pin configuration */
    GPIO_InitStructure.GPIO_Pin = STM32F3D_SPI1_SCK_PIN | STM32F3D_SPI1_MOSI_PIN | STM32F3D_SPI1_MISO_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL; //GPIO_PuPd_DOWN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(STM32F3D_SPI1_GPIO_PORT, &GPIO_InitStructure);

    /* SPI configuration -------------------------------------------------------*/
    SPI_I2S_DeInit(SPI1);
    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    // SPI maximum speed
    actualPrescaler = SPI_BaudRatePrescaler_8;
    SPI_InitStructure.SPI_BaudRatePrescaler = actualPrescaler;
    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial = 7;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
    SPI_Init(SPI1, &SPI_InitStructure);

    /* Configure the RX FIFO Threshold */
    SPI_RxFIFOThresholdConfig(SPI1, SPI_RxFIFOThreshold_QF);
    /* Enable SPI1  */
    SPI_Cmd(SPI1, ENABLE);
}

void SPI1_setPrescaler(uint16_t aPrescaler) {
    // SPI_BaudRatePrescaler_256 is also prescaler mask
    if (aPrescaler == (aPrescaler & SPI_BaudRatePrescaler_256) || aPrescaler == 0) {
        uint16_t tmpreg = SPI1->CR1;
        /* Clear BR[2:0] bits (Baud Rate Control)*/
        tmpreg &= ~SPI_CR1_BR;
        /* Configure SPIx: Data Size */
        tmpreg |= aPrescaler;
        SPI1->CR1 = tmpreg;
        actualPrescaler = aPrescaler;
    } else {
        assert_failed((uint8_t *) __FILE__, __LINE__);
    }
}

inline uint16_t SPI1_getPrescaler(void) {
    return actualPrescaler;
}

#define SPI_TIMEOUT   0x4
/**
 * @brief  Sends a Byte through the SPI interface and return the Byte received
 *         from the SPI bus.
 * @param  Byte : Byte send.
 * @retval The received byte value
 */
uint8_t SPI1_sendReceiveOriginal(uint8_t byte) {
    uint32_t tLR14 = getLR14();

// discard RX FIFO content
    while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) != RESET) {
        SPI_ReceiveData8(SPI1);
    }
    setTimeoutMillis(SPI_TIMEOUT);
// Wait if transmit FIFO buffer full
    while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET) {
        if (isTimeout(tLR14)) {
            return 0;
        }
    }
    /* Send a Byte through the SPI peripheral */
    SPI_SendData8(SPI1, byte);

