ansa256/touchscreen-apps/src/lib/stm32f30xPeripherals.c
    setTimeoutMillis(SPI_TIMEOUT);
    /* Wait to receive a Byte */
    setTimeoutMillis(SPI_TIMEOUT);
    while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET) {
        if (isTimeout(tLR14)) {
            return 0;
        }
    }
    /* Return the Byte read from the SPI bus */
    return (uint8_t) SPI_ReceiveData8(SPI1);
}

/**
 * Version of sendReceive without function calling
 */
static uint32_t inSendReceiveFast = 0; // 0 = not in function LR14 (!=0) already in function
uint8_t SPI1_sendReceiveFast(uint8_t byte) {
    uint32_t tLR14 = getLR14();
    if(inSendReceiveFast) {
        failParamMessage(inSendReceiveFast,"inSendReceiveFast is already in use");
    }
    inSendReceiveFast = tLR14; // set semaphore
// wait for ongoing transfer to end
    while ((SPI1->SR & SPI_I2S_FLAG_BSY) != RESET) {
        ;
    }
// discard RX FIFO content
    uint32_t spixbase = (uint32_t) SPI1;
    spixbase += 0x0C;
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-but-set-variable"
    uint8_t dummy;
#pragma GCC diagnostic pop
    while ((SPI1->SR & SPI_I2S_FLAG_RXNE) != RESET) {
        /* fetch the Byte read from the SPI bus in order to empty RX fifo */
        dummy = *(__IO uint8_t *) spixbase;
    }

    /* Send a Byte through the SPI peripheral */
    *(__IO uint8_t *) spixbase = byte;

    /* Wait to receive a Byte */
    setTimeoutMillis(SPI_TIMEOUT);
    while ((SPI1->SR & SPI_I2S_FLAG_RXNE) == RESET) {
        if (isTimeoutVerbose((uint8_t *) __FILE__, __LINE__, tLR14, 2000)) {
            break;
        }
    }

    /* Return the Byte read from the SPI bus */
    spixbase = (uint32_t) SPI1;
    spixbase += 0x0C;
    inSendReceiveFast = 0; // reset semaphore
    return *(__IO uint8_t *) spixbase;
}

inline void setTimeoutLED(void) {
    STM_EVAL_LEDOn(LED8); // ORANGE FRONT
}

inline void resetTimeoutLED(void) {
    STM_EVAL_LEDOff(LED8); // ORANGE FRONT
}

void RTC_initialize_LSE(void) {

    RTC_InitTypeDef RTC_InitStructure;

    /* Enable PWR APB1 Clock */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);

    /* Allow access to Backup */
    PWR_BackupAccessCmd(ENABLE);

// Enable the LSE OSC
    RCC_LSEConfig(RCC_LSE_ON);

// 40mVPP at RCC_LSEDrive_MediumLow
    RCC_LSEDriveConfig(RCC_LSEDrive_MediumLow);

    // Wait till LSE is ready - it gives timeout if no hardware is attached
    setTimeoutMillis(10);
    while (RCC_GetFlagStatus(RCC_FLAG_LSERDY) == RESET) {
        // use counter directly to avoid setting of timeout led
        if (TimeoutCounterForThread == 0) {
            break;
        }
    }

    /* Select the RTC Clock Source */
    RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);

    /* Enable the RTC Clock */
    RCC_RTCCLKCmd(ENABLE);

    /* Wait for RTC APB registers synchronisation */
    RTC_WaitForSynchro();

    /* RTC prescaler configuration */
    RTC_InitStructure.RTC_HourFormat = RTC_HourFormat_24;
    RTC_InitStructure.RTC_AsynchPrediv = 127; // 127 is the default value for 32kHz
    RTC_InitStructure.RTC_SynchPrediv = 255; // 255 is the default value for 32kHz
    RTC_Init(&RTC_InitStructure);

//RTC_setTime(0, 8, 0, 5, 21, 12, 2012);
    /* Deny access to RTC */
    PWR_BackupAccessCmd(DISABLE);
}

/**
 * year since 1980
 * @return time since 1980 in 10 seconds resolution
 */
DWORD get_fattime(void) {
    RTC_DateTypeDef RTC_DateStructure;
    RTC_TimeTypeDef RTC_TimeStructure;

    /* Get the RTC current Time */
    RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);
    /* Get the RTC current Date */
    RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);
// year since 1980
    DWORD res = (((DWORD) RTC_DateStructure.RTC_Year + 20) << 25) | ((DWORD) RTC_DateStructure.RTC_Month << 21)
            | ((DWORD) RTC_DateStructure.RTC_Date << 16) | (WORD) (RTC_TimeStructure.RTC_Hours << 11)
            | (WORD) (RTC_TimeStructure.RTC_Minutes << 5) | (WORD) (RTC_TimeStructure.RTC_Seconds >> 1);
    return res;
}

void fillTimeStructure(struct tm *aTimeStructurePtr) {
    RTC_DateTypeDef RTC_DateStructure;
    RTC_TimeTypeDef RTC_TimeStructure;

    /* Get the RTC current Time */
    RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);
    /* Get the RTC current Date */
    RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);
    aTimeStructurePtr->tm_year = RTC_DateStructure.RTC_Year + 100;
    aTimeStructurePtr->tm_mon = RTC_DateStructure.RTC_Month - 1;
    aTimeStructurePtr->tm_mday = RTC_DateStructure.RTC_Date;
    aTimeStructurePtr->tm_hour = RTC_TimeStructure.RTC_Hours;
    aTimeStructurePtr->tm_min = RTC_TimeStructure.RTC_Minutes;
    aTimeStructurePtr->tm_sec = RTC_TimeStructure.RTC_Seconds;
}

#define CALIBRATION_MAGIC_NUMBER 0x5A5A5A5A
void RTC_setMagicNumber(void) {
    PWR_BackupAccessCmd(ENABLE);
    // Write magic number
    RTC_WriteBackupRegister(RTC_BKP_DR0, CALIBRATION_MAGIC_NUMBER);
    PWR_BackupAccessCmd(DISABLE);
}

/**
 *
 * @return true if magic number valid
 */bool RTC_checkMagicNumber(void) {
    PWR_BackupAccessCmd(ENABLE);
    // Read magic number
    uint32_t tMagic = RTC_ReadBackupRegister(RTC_BKP_DR0);
    PWR_BackupAccessCmd(DISABLE);
    if (tMagic == CALIBRATION_MAGIC_NUMBER) {
        return true;
    }
    return false;
}

/**
 * not used yet
 */
long RTC_getTimeAsLong(void) {
    struct tm tTm;
    fillTimeStructure(&tTm);
    return mktime(&tTm);
}

/**
 * not used yet
 * @param aStringBuffer
 * @return
 */
int RTC_getTimeStringForFile(char * aStringBuffer) {
    RTC_TimeTypeDef RTC_TimeStructure;

    /* Get the RTC current Time */
    RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);
    /* Display  Format : hh-mm-ss */
// do not have a buffer size :-(
    return sprintf(aStringBuffer, "%02i-%02i-%02i", RTC_TimeStructure.RTC_Hours, RTC_TimeStructure.RTC_Minutes,
            RTC_TimeStructure.RTC_Seconds);
}

/**
 * gets time/date string or seconds since boot if RTC not available
 * Format : yyyy-mm-dd hh-mm-ss
 * @param aStringBuffer
 * @return value of sprintf()
 */
int RTC_getDateStringForFile(char * aStringBuffer) {
    RTC_DateTypeDef RTC_DateStructure;
    RTC_TimeTypeDef RTC_TimeStructure;

    /* Get the RTC current Time */
    RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);
    /* Get the RTC current Date */
    RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);
    if (RTC_DateStructure.RTC_Year != 0) {
        RTC_DateIsValid = true;
    } else {
        // fallback - set time to seconds since boot
        uint32_t tTime = getMillisSinceBoot() / 1000;
        RTC_TimeStructure.RTC_Seconds = tTime % 60;
        tTime = tTime / 60;
        RTC_TimeStructure.RTC_Minutes = tTime % 60;
        tTime = tTime / 60;
        RTC_TimeStructure.RTC_Hours = tTime % 24;
        RTC_DateStructure.RTC_Date = (tTime / 24) + 1;
    }
    /* Display  Format : yyyy-mm-dd hh-mm-ss */
// do not have a buffer size :-(
    return sprintf(aStringBuffer, "%04i-%02i-%02i %02i-%02i-%02i", 2000 + RTC_DateStructure.RTC_Year, RTC_DateStructure.RTC_Month,
            RTC_DateStructure.RTC_Date, RTC_TimeStructure.RTC_Hours, RTC_TimeStructure.RTC_Minutes, RTC_TimeStructure.RTC_Seconds);
}

bool RTC_DateIsValid = false; // true if year != 0

/**
 * Get time/date string for display (European format)
 * Format : dd.mm.yyyy hh:mm:ss
 * sets RTC_DateIsValid to false if RTC not available
 * @param aStringBuffer
 * @return value of sprintf()
 */
int RTC_getTimeString(char * aStringBuffer) {
    RTC_DateTypeDef RTC_DateStructure;
    RTC_TimeTypeDef RTC_TimeStructure;

    /* Get the RTC current Time */
    RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);
    /* Get the RTC current Date */
    RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);
    if (RTC_DateStructure.RTC_Year != 0) {
        RTC_DateIsValid = true;
    }
    /* Display  Format : dd.mm.yyyy hh:mm:ss */
// do not have a buffer size :-(
    return sprintf(aStringBuffer, "%02i.%02i.%04i %02i:%02i:%02i", RTC_DateStructure.RTC_Date, RTC_DateStructure.RTC_Month,
            2000 + RTC_DateStructure.RTC_Year, RTC_TimeStructure.RTC_Hours, RTC_TimeStructure.RTC_Minutes,
            RTC_TimeStructure.RTC_Seconds);
}

void RTC_setTime(uint8_t sec, uint8_t min, uint8_t hour, uint8_t dayOfWeek, uint8_t day, uint8_t month, uint16_t year) {
    RTC_DateTypeDef RTC_DateStructure;
    RTC_TimeTypeDef RTC_TimeStructure;

    RTC_DateStructure.RTC_Year = year - 2000;
    RTC_DateStructure.RTC_Month = month;
    RTC_DateStructure.RTC_Date = day;
    RTC_DateStructure.RTC_WeekDay = dayOfWeek;
    RTC_SetDate(RTC_Format_BIN, &RTC_DateStructure);

