ansa256/touchscreen-apps/src/lib/stm32f30xPeripherals.c
    RTC_TimeStructure.RTC_H12 = RTC_H12_AM;
    RTC_TimeStructure.RTC_Hours = hour;
    RTC_TimeStructure.RTC_Minutes = min;
    RTC_TimeStructure.RTC_Seconds = sec;
    RTC_SetTime(RTC_Format_BIN, &RTC_TimeStructure);
}

/**
 * PWM for tone generation with timer 3
 */
#define STM32F3D_TONE1_TIMER                       TIM3
#define STM32F3D_TONE1_TIMER_CLOCK                 RCC_APB1Periph_TIM3
#define STM32F3D_TONE1_CHANNEL                     TIM_Channel_1
#define STM32F3D_TONE1_GPIO_PIN                    GPIO_Pin_6
#define STM32F3D_TONE1_GPIO_PORT                   GPIOC
#define STM32F3D_TONE1_GPIO_CLK                    RCC_AHBPeriph_GPIOC
#define STM32F3D_TONE1_SOURCE           		   GPIO_PinSource6
#define STM32F3D_TONE1_AF                          GPIO_AF_2

#define TONE_TIMER_TICK_FREQ 1000000
void initalizeTone(void) {
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
    TIM_OCInitTypeDef TIM_OCInitStructure;

    /* TIM3 clock enable */
    RCC_APB1PeriphClockCmd(STM32F3D_TONE1_TIMER_CLOCK, ENABLE);
    uint16_t PrescalerValue = (uint16_t) ((SystemCoreClock / 2) / (TONE_TIMER_TICK_FREQ)) - 1; // 1 MHZ Timer Frequency

    /* Time base configuration */
    TIM_TimeBaseStructure.TIM_Period = 1000; // 1 kHz initial
    TIM_TimeBaseStructure.TIM_Prescaler = PrescalerValue;
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(STM32F3D_TONE1_TIMER, &TIM_TimeBaseStructure);

    GPIO_InitTypeDef GPIO_InitStructure;
    RCC_AHBPeriphClockCmd(STM32F3D_TONE1_GPIO_CLK, ENABLE);
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL; //GPIO_PuPd_DOWN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_InitStructure.GPIO_Pin = STM32F3D_TONE1_GPIO_PIN;
    GPIO_Init(STM32F3D_TONE1_GPIO_PORT, &GPIO_InitStructure);

    GPIO_PinAFConfig(STM32F3D_TONE1_GPIO_PORT, STM32F3D_TONE1_SOURCE, STM32F3D_TONE1_AF);

// Channel 1
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_Inactive;
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_Pulse = TIM_OPMode_Repetitive;
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
    TIM_OC1Init(STM32F3D_TONE1_TIMER, &TIM_OCInitStructure);
    TIM_OC1PreloadConfig(STM32F3D_TONE1_TIMER, TIM_OCPreload_Enable);

    TIM_ARRPreloadConfig(STM32F3D_TONE1_TIMER, ENABLE);
    /* TIM3 enable counter */
    TIM_Cmd(STM32F3D_TONE1_TIMER, ENABLE);

    TIM_SetCompare1(STM32F3D_TONE1_TIMER, 500); // start with 50% duty cycle
}

int32_t ToneDuration = 0; //! signed because >0 means wait, == 0 means action and < 0 means do nothing

void tone(uint16_t aFreqHertz, uint16_t aDurationMillis) {
// enable timer PWM output
    TIM_SelectOCxM(STM32F3D_TONE1_TIMER, STM32F3D_TONE1_CHANNEL, TIM_OCMode_PWM1); // disables channel

// compute reload value
    uint32_t tPeriod = TONE_TIMER_TICK_FREQ / aFreqHertz;
    if (tPeriod >= 0x10000) {
        tPeriod = 0x10000 - 1;
    }
    TIM_SetAutoreload(STM32F3D_TONE1_TIMER, tPeriod - 1);
    TIM_SetCompare1(STM32F3D_TONE1_TIMER, tPeriod / 2); // 50 % duty cycle
    TIM_CCxCmd(STM32F3D_TONE1_TIMER, STM32F3D_TONE1_CHANNEL, TIM_CCx_Enable); // enable channel
    ToneDuration = aDurationMillis;
    changeDelayCallback(&noTone, aDurationMillis);
}

void noTone(void) {
// disable timer PWM output
    TIM_SelectOCxM(STM32F3D_TONE1_TIMER, STM32F3D_TONE1_CHANNEL, TIM_OCMode_Inactive); // disables also channel
}

void FeedbackToneOK(void) {
    FeedbackTone(FEEDBACK_TONE_NO_ERROR);
}

void FeedbackTone(unsigned int aFeedbackType) {
    if (aFeedbackType == FEEDBACK_TONE_NO_TONE) {
        return;
    }
    if (aFeedbackType == FEEDBACK_TONE_NO_ERROR) {
        tone(3000, 50);
    } else if (aFeedbackType == FEEDBACK_TONE_SHORT_ERROR) {
        // two short beeps
        tone(4000, 30);
        delayMillis(60);
        tone(2000, 30);
    } else {
        // long tone
        tone(4500, 500);
    }
}

void EndTone(void) {
    tone(880, 1000);
    delayMillis(1000);
    tone(660, 1000);
    delayMillis(1000);
    tone(440, 1000);
}

/**
 * PWM for display backlight with timer 4
 */

#define STM32F3D_PWM_BL_TIMER                       TIM4
#define STM32F3D_PWM_BL_TIMER_CLOCK                 RCC_APB1Periph_TIM4

// for pin F6
#define STM32F3D_PWM_BL_GPIO_PIN                    GPIO_Pin_6
#define STM32F3D_PWM_BL_GPIO_PORT                   GPIOF
#define STM32F3D_PWM_BL_GPIO_CLK                    RCC_AHBPeriph_GPIOF
#define STM32F3D_PWM_BL_SOURCE           			GPIO_PinSource6
#define STM32F3D_PWM_BL_AF                          GPIO_AF_2
#define STM32F3D_PWM_BL_CHANNEL                     TIM_Channel_4
#define STM32F3D_PWM_BL_CHANNEL_INIT_COMMAND        TIM_OC4Init
#define STM32F3D_PWM_BL_CHANNEL_PRELOAD_COMMAND     TIM_OC4PreloadConfig
#define STM32F3D_PWM_BL_CHANNEL_SET_COMMAND         TIM_SetCompare4

#define PWM_RESOLUTION_BACKLIGHT 0x100 // 0-255, 256 = constant-high
void PWM_BL_initalize(void) {
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
    TIM_OCInitTypeDef TIM_OCInitStructure;

    /* TIM4 clock enable */
    RCC_APB1PeriphClockCmd(STM32F3D_PWM_BL_TIMER_CLOCK, ENABLE);

    /* Compute the prescaler value for 1 kHz period with 256 resolution*/
    uint16_t PrescalerValue = (uint16_t) ((SystemCoreClock / 2) / (1000 * PWM_RESOLUTION_BACKLIGHT)) - 1;

    /* Time base configuration */
    TIM_TimeBaseStructure.TIM_Period = PWM_RESOLUTION_BACKLIGHT - 1;
    TIM_TimeBaseStructure.TIM_Prescaler = PrescalerValue;
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(STM32F3D_PWM_BL_TIMER, &TIM_TimeBaseStructure);

    GPIO_InitTypeDef GPIO_InitStructure;

    RCC_AHBPeriphClockCmd(STM32F3D_PWM_BL_GPIO_CLK, ENABLE);

