ansa256/touchscreen-apps/src/lib/stm32f30xPeripherals.c
// Configure pin as alternate function for timer
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL; //GPIO_PuPd_DOWN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Pin = STM32F3D_PWM_BL_GPIO_PIN;
    GPIO_Init(STM32F3D_PWM_BL_GPIO_PORT, &GPIO_InitStructure);
    GPIO_PinAFConfig(STM32F3D_PWM_BL_GPIO_PORT, STM32F3D_PWM_BL_SOURCE, STM32F3D_PWM_BL_AF);

// Channel
    /* PWM1 Mode configuration */
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_Pulse = TIM_OPMode_Repetitive;
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
    STM32F3D_PWM_BL_CHANNEL_INIT_COMMAND(STM32F3D_PWM_BL_TIMER, &TIM_OCInitStructure);

    STM32F3D_PWM_BL_CHANNEL_PRELOAD_COMMAND(STM32F3D_PWM_BL_TIMER, TIM_OCPreload_Enable);
    TIM_ARRPreloadConfig(STM32F3D_PWM_BL_TIMER, ENABLE);
    /* TIM4 enable counter */
    TIM_Cmd(STM32F3D_PWM_BL_TIMER, ENABLE);

// Set channel 4 value
    STM32F3D_PWM_BL_CHANNEL_SET_COMMAND(STM32F3D_PWM_BL_TIMER, PWM_RESOLUTION_BACKLIGHT / 2); // start with 50% duty cycle
    TIM_CCxCmd(STM32F3D_PWM_BL_TIMER, STM32F3D_PWM_BL_CHANNEL, TIM_CCx_Enable); // enable channel
}

void PWM_BL_setOnRatio(uint32_t aOnTimePercent) {
    if (aOnTimePercent >= 100) {
        aOnTimePercent = 100;
    }
    STM32F3D_PWM_BL_CHANNEL_SET_COMMAND(STM32F3D_PWM_BL_TIMER, (uint32_t) aOnTimePercent * 256 / 100);
}

void ADC12_init(void) {
    /**
     * Configure the ADC clock
     */
    RCC_ADCCLKConfig(RCC_ADC12PLLCLK_Div8); // 9Mhz
}

/**
 * ADC1
 */
#define ADC1_PERIPH_CLOCK                   	RCC_AHBPeriph_ADC12

#define ADC1_INPUT1_PIN                         GPIO_Pin_1
#define ADC1_INPUT_GPIO_PORT                    GPIOA
#define ADC1_INPUT_GPIO_CLK                     RCC_AHBPeriph_GPIOA

#define ADC1_INPUT2_PIN                         GPIO_Pin_2

#define ADC1_INPUT3_PIN                         GPIO_Pin_3

#define ADC1_ATTENUATOR_0_PIN                   GPIO_Pin_7
#define ADC1_ATTENUATOR_1_PIN                   GPIO_Pin_8
#define ADC1_ATTENUATOR_2_PIN                   GPIO_Pin_9
#define ADC1_AC_RANGE_PIN                       GPIO_Pin_12
#define ADC1_ATTENUATOR_GPIO_PORT               GPIOC
#define ADC1_ATTENUATOR_GPIO_CLK                RCC_AHBPeriph_GPIOC

static bool isADCInitializedForTimerEvents;

void ADC_init(void) {
    GPIO_InitTypeDef GPIO_InitStructure;
    ADC_InitTypeDef ADC_InitStructure;
    ADC_CommonInitTypeDef ADC_CommonInitStructure;

    ADC_DMA_initialize();

    /* Enable ADC1 clock */
    RCC_AHBPeriphClockCmd(ADC1_PERIPH_CLOCK, ENABLE);

    /**
     * ADC GPIO input pin init
     */
    RCC_AHBPeriphClockCmd(ADC1_INPUT_GPIO_CLK, ENABLE);
// Configure pin A1 + A2 + A3 as analog input
    GPIO_InitStructure.GPIO_Pin = ADC1_INPUT1_PIN | ADC1_INPUT2_PIN | ADC1_INPUT3_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_Init(ADC1_INPUT_GPIO_PORT, &GPIO_InitStructure);

    /**
     * Enable special channels
     */
    ADC_TempSensorCmd(DSO_ADC_ID, ENABLE);
    ADC_VrefintCmd(DSO_ADC_ID, ENABLE);
    ADC_VbatCmd(DSO_ADC_ID, ENABLE);

    /**
     *  Calibration procedure
     */
    ADC_VoltageRegulatorCmd(DSO_ADC_ID, ENABLE);
    /* To settle reference voltage etc. */
    delayMillis(2);
    ADC_SelectCalibrationMode(DSO_ADC_ID, ADC_CalibrationMode_Single);
    ADC_StartCalibration(DSO_ADC_ID);
    while (ADC_GetCalibrationStatus(DSO_ADC_ID) != RESET) {
        ;
    }

// use defaults
    ADC_CommonStructInit(&ADC_CommonInitStructure);
//	ADC_CommonInitStructure.ADC_Mode = ADC_Mode_Independent;
//	ADC_CommonInitStructure.ADC_Clock = ADC_Clock_AsynClkMode; // allows higher clock prescaler
//	ADC_CommonInitStructure.ADC_DMAAccessMode = ADC_DMAAccessMode_Disabled; // multiple DMA mode disabled
//	ADC_CommonInitStructure.ADC_DMAMode = ADC_DMAMode_OneShot;
//	ADC_CommonInitStructure.ADC_TwoSamplingDelay = 0;
    ADC_CommonInit(DSO_ADC_ID, &ADC_CommonInitStructure);

    ADC_StructInit(&ADC_InitStructure);
//	ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
//	ADC_InitStructure.ADC_ContinuousConvMode = ADC_ContinuousConvMode_Disable;
    ADC_InitStructure.ADC_ExternalTrigConvEvent = ADC_ExternalTrigConvEvent_13; //TIM6_TRGO event
    ADC_InitStructure.ADC_ExternalTrigEventEdge = ADC_ExternalTrigEventEdge_RisingEdge;
//	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_OverrunMode = ADC_OverrunMode_Enable;
//	ADC_InitStructure.ADC_AutoInjMode = ADC_AutoInjec_Disable;
//	ADC_InitStructure.ADC_NbrOfRegChannel = 1;
    ADC_Init(DSO_ADC_ID, &ADC_InitStructure);
    isADCInitializedForTimerEvents = true;

    ADC_DMACmd(DSO_ADC_ID, ENABLE);

    ADC_DMAConfig(DSO_ADC_ID, ADC_DMAMode_OneShot);

    /* Enable ADC */
    ADC_enableAndWait(DSO_ADC_ID);

    NVIC_InitTypeDef NVIC_InitStructure;
    /* Enable the ADC1 global Interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = ADC1_2_IRQn;
// almost highest priority
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    DSO_initializeAttenuatorAndAC();
    ADC_initalizeTimer6();
}

void ADC_enableAndWait(ADC_TypeDef* aADCId) {
    ADC_Cmd(DSO_ADC_ID, ENABLE);
    /* wait for ADRDY */
    setTimeoutMillis(ADC_DEFAULT_TIMEOUT);
    while (!ADC_GetFlagStatus(DSO_ADC_ID, ADC_FLAG_RDY)) {
        if (isTimeout(DSO_ADC_ID->ISR)) {
            break;
        }
    }
}

void ADC_disableAndWait(ADC_TypeDef* aADCId) {
// assert that ADC conversion is stopped
    assert_param(ADC_GetStartConversionStatus(aADCId) == RESET);
// first disable ADC otherwise sometimes interrupts just stops after the first reading
    ADC_DisableCmd(aADCId);
// wait for disable to complete
    setTimeoutMillis(ADC_DEFAULT_TIMEOUT);
    while (ADC_GetDisableCmdStatus(aADCId) != RESET) {
        if (isTimeout(aADCId->CR)) {
            break;
        }
    }
}

/**
 * ADC must be ready and continuous mode disabled
 * returns 2 * ADC_MAX_CONVERSION_VALUE on timeout
 */
uint16_t ADC1_getChannelValue(uint8_t aChannel) {

    if (isADCInitializedForTimerEvents) {
        // reconfigure ADC
        ADC_InitTypeDef ADC_InitStructure;
        // use defaults
        ADC_StructInit(&ADC_InitStructure);
        ADC_Init(DSO_ADC_ID, &ADC_InitStructure);
    }
// use conservative sample time (ADC Clocks!)
// temperature needs 2.2 micro seconds
    ADC_RegularChannelConfig(ADC1, aChannel, 1, ADC_SampleTime_4Cycles5);

// use slow clock
    RCC_ADCCLKConfig(RCC_ADC12PLLCLK_Div64); // 1,125 MHz

    ADC_StartConversion(ADC1);
    /* Test EOC flag */
    setTimeoutMillis(ADC_DEFAULT_TIMEOUT);
    while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET) {
        if (isTimeoutShowDelay(ADC1->CR, 600)) {
            return 2 * ADC_MAX_CONVERSION_VALUE;
        }
    }

    // restore ADC configuration for timer events
    if (isADCInitializedForTimerEvents) {
        ADC_InitTypeDef ADC_InitStructure;
        ADC_StructInit(&ADC_InitStructure);
        ADC_InitStructure.ADC_ExternalTrigConvEvent = ADC_ExternalTrigConvEvent_13; //TIM6_TRGO event
        ADC_InitStructure.ADC_ExternalTrigEventEdge = ADC_ExternalTrigEventEdge_RisingEdge;
        ADC_InitStructure.ADC_OverrunMode = ADC_OverrunMode_Enable;
        ADC_Init(DSO_ADC_ID, &ADC_InitStructure);
    }
    return ADC_GetConversionValue(ADC1);
}

void ADC_SetChannelSampleTime(ADC_TypeDef* aADCId, uint8_t aChannelNumber, bool aFastMode) {
    uint8_t tSampleTime = ADC_SampleTime_1Cycles5;
    switch (aChannelNumber) {
    case ADC_Channel_2: // fast channels
    case ADC_Channel_3:
    case ADC_Channel_4:
        if (!aFastMode) {
            tSampleTime = ADC_SampleTime_4Cycles5;
        }
        break;
    case ADC_Channel_7: //slow channel
        if (!aFastMode) {
            tSampleTime = ADC_SampleTime_7Cycles5;
        }
        break;
    case ADC_Channel_TempSensor:
    case ADC_Channel_Vbat:
    case ADC_Channel_Vrefint:
        // TEMP + VBAT channel need 2.2 micro sec. sampling
        if (!aFastMode) {
            tSampleTime = ADC_SampleTime_61Cycles5;
        }
        break;
    default:
        break;
    }
    ADC_RegularChannelConfig(aADCId, aChannelNumber, 1, tSampleTime);
}

inline void ADC_enableEOCInterrupt(ADC_TypeDef* aADCId) {
    ADC_ITConfig(aADCId, ADC_IT_EOC, ENABLE);
}

inline void ADC_disableEOCInterrupt(ADC_TypeDef* aADCId) {
    ADC_ITConfig(aADCId, ADC_IT_EOC, DISABLE);
}

/**
 *
 * @return ADC configuration register
 */
uint32_t ADC_getCFGR(void) {
    return (DSO_ADC_ID->CFGR);
}

/**
 * Stub to pass right parameters
 */
inline void ADC_clearITPendingBit(ADC_TypeDef* aADCId) {
    ADC_ClearITPendingBit(DSO_ADC_ID, ADC_IT_EOC);
}

/**
 * from 0x00 to 0x0B which results in prescaler from 1 to 256
 */
void ADC_SetClockPrescaler(uint32_t aValue) {
    aValue &= 0x0F;
    if (aValue > 0x0B) {
        aValue = 0x0B;
    }
    aValue = (aValue << 4) + RCC_ADC12PLLCLK_Div1;
    RCC_ADCCLKConfig(aValue);
}

