ansa256/touchscreen-apps/src/lib/stm32f30xPeripherals.c
#define STM32F3D_ADC_TIMER                       TIM6
#define STM32F3D_ADC_TIMER_CLOCK                 RCC_APB1Periph_TIM6

#define STM32F3D_ADC_TIMER_PRESCALER_START (9 - 1)

void ADC_initalizeTimer6(void) {
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;

    /* TIM6 clock enable */
    RCC_APB1PeriphClockCmd(STM32F3D_ADC_TIMER_CLOCK, ENABLE);

    /* Time base configuration */
    TIM_TimeBaseStructure.TIM_Prescaler = STM32F3D_ADC_TIMER_PRESCALER_START; // 1/8 us resolution (72/9)
    TIM_TimeBaseStructure.TIM_Period = 25 - 1; // 10 us
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseStructure.TIM_RepetitionCounter = 0x00;
    TIM_TimeBaseInit(STM32F3D_ADC_TIMER, &TIM_TimeBaseStructure);

    TIM_SelectOutputTrigger(STM32F3D_ADC_TIMER, TIM_TRGOSource_Update);

// enable Interrupt for testing purposes
//	ADC_Timer6EnableInterrupt();
}

/**
 * not used yet
 */
void ADC_Timer6EnableInterrupt(void) {
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = TIM6_DAC_IRQn;
// lowest possible priority
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    TIM_ITConfig(STM32F3D_ADC_TIMER, TIM_IT_Update, ENABLE);
}

/**
 * ISR for ADC timer 6 and for DAC1&2 underrun error interrupts
 * not used yet
 */
void TIM6_DAC_IRQHandler(void) {
    STM_EVAL_LEDToggle(LED7); // GREEN RIGHT
    TIM_ClearITPendingBit(STM32F3D_ADC_TIMER, TIM_IT_Update);
}

void ADC_SetTimer6Period(uint16_t aDivider, uint16_t aPrescalerDivider) {
    TIM_PrescalerConfig(STM32F3D_ADC_TIMER, aPrescalerDivider - 1, TIM_PSCReloadMode_Immediate);
    TIM_SetAutoreload(STM32F3D_ADC_TIMER, aDivider - 1);
}

inline void ADC_startTimer6(void) {
// Enable the TIM Counter
    // TIM_Cmd(STM32F3D_ADC_TIMER, ENABLE);
    STM32F3D_ADC_TIMER->CR1 |= TIM_CR1_CEN;
}

inline void ADC_stopTimer6(void) {
    TIM_Cmd(STM32F3D_ADC_TIMER, DISABLE);
}

/*
 * ADC DMA
 */
void ADC_DMA_initialize(void) {
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

    DMA_InitTypeDef DMA_InitStructure;
// DMA1 channel1 configuration
    DMA_DeInit(DSO_DMA_CHANNEL);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t) &(DSO_ADC_ID->DR);
    DMA_InitStructure.DMA_MemoryBaseAddr = 0;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize = 1;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
//	DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DSO_DMA_CHANNEL, &DMA_InitStructure);

    NVIC_InitTypeDef NVIC_InitStructure;
    /* Enable DMA1 channel1 IRQ Channel */
    NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel1_IRQn;
//  prio 3/0 because it takes so much CPU that touch events do not really work
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

//TC -> transfer complete interrupt
// Enable DMA1 channel1
//	DMA_ITConfig(DSO_DMA_CHANNEL, DMA_IT_TC | DMA_IT_HT | DMA_IT_TE, ENABLE);
    DMA_ITConfig(DSO_DMA_CHANNEL, DMA_IT_TC | DMA_IT_TE, ENABLE);
}

void ADC_DMA_start(uint32_t aMemoryBaseAddr, uint16_t aBufferSize) {
// Disable DMA1 channel1 - is really needed here!
    DSO_DMA_CHANNEL->CCR &= ~DMA_CCR_EN;

// Write to DMA Channel1 CMAR
    DSO_DMA_CHANNEL->CMAR = aMemoryBaseAddr;
// Write to DMA1 Channel1 CNDTR
    DSO_DMA_CHANNEL->CNDTR = aBufferSize;

//	DMA_Cmd(DSO_DMA_CHANNEL, ENABLE);
// enable channel and all interrupts too
    DSO_DMA_CHANNEL->CCR |= (DMA_CCR_EN | DMA_CCR_TCIE | DMA_CCR_HTIE | DMA_CCR_TEIE);
// starts conversion at next timer edge - is definitely needed to start dma transfer!
    DSO_ADC_ID->CR |= ADC_CR_ADSTART;

}

uint16_t ADC_DMA_GetCurrDataCounter(void) {
    return ((uint16_t) (DSO_DMA_CHANNEL->CNDTR));
}

void ADC_DMA_stop(void) {
// Disable DMA1 channel1
    DSO_DMA_CHANNEL->CCR &= (uint16_t) (~DMA_CCR_EN);
// Disable ADC DMA
    ADC_DMACmd(DSO_ADC_ID, DISABLE);
// reset all bits
    DMA_ClearITPendingBit(DMA1_IT_GL1);
//TC -> transfer complete interrupt
    DMA_ITConfig(DSO_DMA_CHANNEL, DMA1_IT_TC1, DISABLE);
}

/*
 * read internal Temp sensor by ADC1 channel 16 and convert it
 */
int ADC_getTemperatureMilligrades(void) {

    int tADCTempShift3 = ADC1_getChannelValue(ADC_Channel_TempSensor);
    // convert it to value at 3.3 V
    tADCTempShift3 = ((tADCTempShift3 * (*((uint16_t*) 0x1FFFF7BA))) << 3) / sRefintActualValue;

    int tTempValueAt30Degree = *(uint16_t*) (0x1FFFF7B8);  //0x6BE
    int tTempValueAt110Degree = *(uint16_t*) (0x1FFFF7C2); //0x509
    // 1.43V at 25C = 0x6EE  4.3mV/C => 344mV/80C
    if (sTempValueAtZeroDegreeShift3 == 0) {
        // not initialized -> do it here
        sTempValueAtZeroDegreeShift3 = (tTempValueAt30Degree << 3) - ((tTempValueAt110Degree - tTempValueAt30Degree) * 3);
    }
    return ((sTempValueAtZeroDegreeShift3 - tADCTempShift3) * 10000) / (tTempValueAt30Degree - tTempValueAt110Degree);
}

float ADC_getTemperature(void) {
    float tActualTemperature = (float) ADC_getTemperatureMilligrades();
    return tActualTemperature / 1000;
}

/*
 * DSO Attenuator
 */
void DSO_initializeAttenuatorAndAC(void) {
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Enable the GPIO Clock */
    RCC_AHBPeriphClockCmd(ADC1_ATTENUATOR_GPIO_CLK, ENABLE);

// Bit 0,1,2 pin, AC range pin
    GPIO_InitStructure.GPIO_Pin = ADC1_ATTENUATOR_0_PIN | ADC1_ATTENUATOR_1_PIN | ADC1_ATTENUATOR_2_PIN | ADC1_AC_RANGE_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(ADC1_ATTENUATOR_GPIO_PORT, &GPIO_InitStructure);
// set LOW
    GPIO_ResetBits(ADC1_ATTENUATOR_GPIO_PORT,
            ADC1_ATTENUATOR_0_PIN | ADC1_ATTENUATOR_1_PIN | ADC1_ATTENUATOR_2_PIN | ADC1_AC_RANGE_PIN);
}

void DSO_setAttenuator(uint8_t aValue) {
// shift to right bit position
    uint16_t tValue = aValue << 7;

