ansa256/touchscreen-apps/src/lib/stm32f30xPeripherals.c
    tValue = tValue & 0x380;
    uint16_t tPort = GPIO_ReadOutputData(ADC1_ATTENUATOR_GPIO_PORT);
    tPort &= ~0x380;
    tPort |= tValue;
    GPIO_Write(ADC1_ATTENUATOR_GPIO_PORT, tPort);
}

void DSO_setACRange(bool aValue) {
    GPIO_WriteBit(ADC1_ATTENUATOR_GPIO_PORT, ADC1_AC_RANGE_PIN, aValue);
}

bool DSO_getACRange(void) {
    return GPIO_ReadOutputDataBit(ADC1_ATTENUATOR_GPIO_PORT, ADC1_AC_RANGE_PIN);
}

#define MICROSD_CS_PIN                         GPIO_Pin_5
#define MICROSD_CS_GPIO_PORT                   GPIOC
#define MICROSD_CS_GPIO_CLK                    RCC_AHBPeriph_GPIOC

#define MICROSD_CARD_DETECT_PIN                GPIO_Pin_4
#define MICROSD_CARD_DETECT_GPIO_PORT          GPIOC
#define MICROSD_CARD_DETECT_GPIO_CLK           RCC_AHBPeriph_GPIOC
#define MICROSD_CARD_DETECT_EXTI_PORT_SOURCE   EXTI_PortSourceGPIOC
#define MICROSD_CARD_DETECT_EXTI_PIN_SOURCE    EXTI_PinSource4
#define MICROSD_CARD_DETECT_EXTI_LINE          EXTI_Line4
#define MICROSD_CARD_DETECT_EXTI_IRQn          EXTI4_IRQn

/**
 * Init the MicroSD card pins CS + CardDetect
 */
void MICROSD_IO_initalize(void) {
    GPIO_InitTypeDef GPIO_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;
    EXTI_InitTypeDef EXTI_InitStructure;

// Enable the GPIO Clock
    RCC_AHBPeriphClockCmd(MICROSD_CS_GPIO_CLK, ENABLE);

// CS pin
    GPIO_InitStructure.GPIO_Pin = MICROSD_CS_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(MICROSD_CS_GPIO_PORT, &GPIO_InitStructure);
// set High
    GPIO_SetBits(MICROSD_CS_GPIO_PORT, MICROSD_CS_PIN);

// CardDetect pin
    GPIO_InitStructure.GPIO_Pin = MICROSD_CARD_DETECT_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_Init(MICROSD_CARD_DETECT_GPIO_PORT, &GPIO_InitStructure);

// Connect EXTI Line to GPIO Pin
// Enable the Sysycfg Clock
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
    SYSCFG_EXTILineConfig(MICROSD_CARD_DETECT_EXTI_PORT_SOURCE, MICROSD_CARD_DETECT_EXTI_PIN_SOURCE);

    /* Configure EXTI line */
    EXTI_InitStructure.EXTI_Line = MICROSD_CARD_DETECT_EXTI_LINE;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);

    /* Enable and set EXTI Interrupt to the lowest priority */
    NVIC_InitStructure.NVIC_IRQChannel = MICROSD_CARD_DETECT_EXTI_IRQn;
// lowest possible priority
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

// Enable and set User button EXTI Interrupt to  priority 0/3
    NVIC_InitStructure.NVIC_IRQChannel = USER_BUTTON_EXTI_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

inline bool MICROSD_isCardInserted(void) {
    return GPIO_ReadInputDataBit(MICROSD_CARD_DETECT_GPIO_PORT, MICROSD_CARD_DETECT_PIN);
}

inline void MICROSD_CSEnable(void) {
// set to LOW
    MICROSD_CARD_DETECT_GPIO_PORT->BRR = MICROSD_CS_PIN;
}

inline void MICROSD_CSDisable(void) {
// set to HIGH
    MICROSD_CARD_DETECT_GPIO_PORT->BSRR = MICROSD_CS_PIN;
}

inline void MICROSD_ClearITPendingBit(void) {
    EXTI_ClearITPendingBit(MICROSD_CARD_DETECT_EXTI_LINE);
}

#define DAC_OUTPUT_PIN                       GPIO_Pin_4
#define DAC_OUTPUT_GPIO_PORT                 GPIOA
#define DAC_OUTPUT_GPIO_CLK                  RCC_AHBPeriph_GPIOA

/**
 * @brief  DAC channels configurations (PA4 in analog,
 *                           enable DAC clock, enable DMA2 clock)
 */
void DAC_init(void) {
    GPIO_InitTypeDef GPIO_InitStructure;

    /* DMA2 clock enable (to be used with DAC) */
//	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);
    /* DAC Periph clock enable */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);

    /* GPIOA clock enable */
    RCC_AHBPeriphClockCmd(DAC_OUTPUT_GPIO_CLK, ENABLE);

    /* Configure PA.04 (DAC_OUT1) as analog in to avoid parasitic consumption */
    GPIO_InitStructure.GPIO_Pin = DAC_OUTPUT_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_Init(DAC_OUTPUT_GPIO_PORT, &GPIO_InitStructure);

// set triangle Mode
    DAC_ModeTriangle();

// set output data register
    DAC_SetChannel1Data(DAC_Align_12b_R, 0);

}

/* TIM7 configuration to trigger DAC */
void DAC_Timer_initialize(uint32_t aAutoreload) {
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;

    /* TIM7 Peripheral clock enable */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE);

    /* Time base configuration */
    TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
//	TIM_TimeBaseStructure.TIM_Prescaler = 0x0; // no prescaler
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Down; // to easily change reload value
    TIM_TimeBaseStructure.TIM_Period = aAutoreload;
//	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInit(TIM7, &TIM_TimeBaseStructure);

// TIM7 TRGO selection - trigger on each update
    TIM_SelectOutputTrigger(TIM7, TIM_TRGOSource_Update);

    /* TIM7 enable counter */
    TIM_Cmd(TIM7, ENABLE);
}

/**
 *
 * @param aReloadValue value less than 4 makes no sense since reload operation takes 3 ticks
 */
inline void DAC_Timer_SetReloadValue(uint32_t aReloadValue) {
    if (aReloadValue < DAC_TIMER_MIN_RELOAD_VALUE) {
        assertFailedParamMessage((uint8_t *) __FILE__, __LINE__, getLR14(), aReloadValue, "DAC reload value < 4");
    }
    uint32_t tReloadValue = aReloadValue;
    uint16_t tPrescalerValue = 1;
// convert 32 bit to 16 bit prescaler and 16 bit counter
    if (tReloadValue > 0xFFFF) {
        //Count Leading Zeros
        int tShiftCount = 16 - __CLZ(aReloadValue);
        tPrescalerValue <<= tShiftCount;
        tReloadValue = aReloadValue >> tShiftCount;
    }
    TIM_PrescalerConfig(TIM7, tPrescalerValue - 1, TIM_PSCReloadMode_Update);
    TIM_SetAutoreload(TIM7, tReloadValue - 1);
}

/**
 * Enable DAC Channel1: Once the DAC channel1 is enabled, Pin A.05 is automatically connected to the DAC converter.
 */
void DAC_Start(void) {
    DAC_Cmd(DAC_Channel_1, ENABLE);
    TIM_Cmd(TIM7, ENABLE);
}

void DAC_Stop(void) {
    TIM_Cmd(TIM7, DISABLE);
    DAC_Cmd(DAC_Channel_1, DISABLE);

