ansa256/touchscreen-apps/src/lib/stm32f30xPeripherals.c
}

/* Noise Wave generator */
void DAC_ModeNoise(void) {

    DAC_InitTypeDef DAC_InitStructure;

    /* DAC channel1 Configuration */
    DAC_DeInit();
    DAC_InitStructure.DAC_Trigger = DAC_Trigger_T7_TRGO;
    DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_Noise;
    DAC_InitStructure.DAC_LFSRUnmask_TriangleAmplitude = DAC_LFSRUnmask_Bits11_0;
    DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Enable;
    DAC_Init(DAC_Channel_1, &DAC_InitStructure);

    /* Set DAC Channel1 DHR12L register */
    DAC_SetChannel1Data(DAC_Align_12b_L, 0x7FF0);

    /* Enable DAC channel1 wave generator */
    DAC_WaveGenerationCmd(DAC_Channel_1, DAC_Wave_Noise, ENABLE);
}

/* Triangle Wave generator */
void DAC_ModeTriangle(void) {

    DAC_InitTypeDef DAC_InitStructure;

    /* DAC channel1 Configuration */
    DAC_DeInit();
    DAC_InitStructure.DAC_Trigger = DAC_Trigger_T7_TRGO;
    DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_Triangle;
    DAC_InitStructure.DAC_LFSRUnmask_TriangleAmplitude = DAC_TriangleAmplitude_2047;
    DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Enable;
    DAC_Init(DAC_Channel_1, &DAC_InitStructure);

    /* Enable DAC channel1 wave generator */
    DAC_WaveGenerationCmd(DAC_Channel_1, DAC_Wave_Triangle, ENABLE);
}

inline void DAC_SetOutputValue(uint16_t aOutputValue) {
    DAC_SetChannel1Data(DAC_Align_12b_R, aOutputValue);
}

// amplitude from 0 to 0x0B
void DAC_TriangleAmplitude(unsigned int aAmplitude) {
    aAmplitude &= 0x0F;
    if (aAmplitude > 0x0B) {
        aAmplitude = 0x0B;
    }
    uint32_t tTemp = DAC->CR;
    tTemp &= ~0xF00;
    tTemp |= aAmplitude << 8;
    DAC->CR = tTemp;
}

/*
 * Timer 15 for IR handling
 */
void IR_Timer_initialize(uint16_t aAutoreload) {
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM15, ENABLE);
    /* Time base configuration */
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;

    TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
//TIM_TimeBaseStructure.TIM_Prescaler = 0x0; // no prescaler
//TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; // to easily change reload value
    TIM_TimeBaseStructure.TIM_Period = aAutoreload;
//TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInit(TIM15, &TIM_TimeBaseStructure);

    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = TIM1_BRK_TIM15_IRQn;
// high priority - to enable interrupting slider handling by systic interrupt
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    TIM_ITConfig(TIM15, TIM_IT_Update, ENABLE);
}

void IR_Timer_Start(void) {
    TIM_Cmd(TIM15, ENABLE);
}

void IR_Timer_Stop(void) {
    TIM_Cmd(TIM15, DISABLE);
}

#define FREQ_SYNTH_OUTPUT_PIN                       GPIO_Pin_9
#define FREQ_SYNTH_OUTPUT_GPIO_PORT                 GPIOA
#define FREQ_SYNTH_OUTPUT_GPIO_CLK                  RCC_AHBPeriph_GPIOA
#define FREQ_SYNTH_OUTPUT_SOURCE           			GPIO_PinSource9
#define FREQ_SYNTH_OUTPUT_AF                        GPIO_AF_10

/* TIM2 configuration for frequency synthesizer */
void HIRES_Timer_initialize(uint32_t aAutoreload) {
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;

    /* TIM2 Peripheral clock enable */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

    /* Time base configuration */
    TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
//	TIM_TimeBaseStructure.TIM_Prescaler = 0x0; // no prescaler
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Down; // to easily change reload value
    TIM_TimeBaseStructure.TIM_Period = aAutoreload;
//	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

    TIM_OCInitTypeDef TIM_OCInitStructure;

// Channel 3
    /* Toggle Mode configuration */
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_Toggle;
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_Pulse = TIM_OPMode_Repetitive;
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
    TIM_OC3Init(TIM2, &TIM_OCInitStructure);

// init output pin
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Enable the GPIO Clocks */
    RCC_AHBPeriphClockCmd(FREQ_SYNTH_OUTPUT_GPIO_CLK, ENABLE);

// Synthesizer output pin
    GPIO_InitStructure.GPIO_Pin = FREQ_SYNTH_OUTPUT_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(FREQ_SYNTH_OUTPUT_GPIO_PORT, &GPIO_InitStructure);
    GPIO_PinAFConfig(FREQ_SYNTH_OUTPUT_GPIO_PORT, FREQ_SYNTH_OUTPUT_SOURCE, FREQ_SYNTH_OUTPUT_AF);

// set Low
//	GPIO_ResetBits(FREQ_SYNTH_OUTPUT_GPIO_PORT, FREQ_SYNTH_OUTPUT_PIN);
}

/**
 *
 * @param reload value
 */
inline void HIRES_Timer_SetReloadValue(uint32_t aReloadValue) {
// this causes the compiler to crash here
//assertParamMessage((aReloadValue > 1), aReloadValue, "HIRES reload value < 2");
    if (aReloadValue < 2) {
        assertFailedParamMessage((uint8_t *) __FILE__, __LINE__, getLR14(), aReloadValue, "HIRES reload value < 2");
    }
    TIM_SetAutoreload(TIM2, aReloadValue - 1);
}

void HIRES_Timer_Start(void) {
    TIM_Cmd(TIM2, ENABLE);
}

/**
 *
 * @return actual counter before stop
 */
uint32_t HIRES_Timer_Stop(void) {
    uint32_t tCount = TIM_GetCounter(TIM2);
    TIM_Cmd(TIM2, DISABLE);
    return tCount;
}

uint32_t HIRES_Timer_GetCounter(void) {
    return TIM_GetCounter(TIM2);
}

/**
 * Init the Debug pin E7
 */
void Debug_IO_initalize(void) {
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Enable the GPIO Clocks */
    RCC_AHBPeriphClockCmd(DEBUG_GPIO_CLK, ENABLE);

// Debug pin
    GPIO_InitStructure.GPIO_Pin = DEBUG_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(DEBUG_GPIO_PORT, &GPIO_InitStructure);
// set Low
    GPIO_ResetBits(DEBUG_GPIO_PORT, DEBUG_PIN);
}

inline void Default_IRQHandler(void) {
    STM_EVAL_LEDToggle(LED10); // RED FRONT
}
/** @} */
